leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5668_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5668PORTS_H
#define _MPC5668PORTS_H

/* Pin:0 Name:PA0 */
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:1 Name:PA1 */
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:2 Name:PA2 */
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:3 Name:PA3 */
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:4 Name:PA4 */
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:5 Name:PA5 */
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:6 Name:PA6 */
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:7 Name:PA7 */
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:8 Name:PA8 */
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:9 Name:PA9 */
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:10 Name:PA10 */
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:11 Name:PA11 */
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:12 Name:PA12 */
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:13 Name:PA13 */
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:14 Name:PA14 */
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:15 Name:PA15 */
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:16 Name:PB0 */
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:17 Name:PB1 */
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:18 Name:PB2 */
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:19 Name:PB3 */
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:20 Name:PB4 */
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:21 Name:PB5 */
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:22 Name:PB6 */
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:23 Name:PB7 */
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:24 Name:PB8 */
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_SPI_A PORT_FUNC2 

/* Pin:25 Name:PB9 */
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_SPI_A PORT_FUNC2 

/* Pin:26 Name:PB10 */
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_SPI_B PORT_FUNC2 

/* Pin:27 Name:PB11 */
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_SPI_B PORT_FUNC2 

/* Pin:28 Name:PB12 */
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_SPI_C PORT_FUNC2 

/* Pin:29 Name:PB13 */
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_SPI_C PORT_FUNC2 

/* Pin:30 Name:PB14 */
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_SPI_D PORT_FUNC2 

/* Pin:31 Name:PB15 */
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_SPI_D PORT_FUNC2 

/* Pin:32 Name:PC0 */
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:33 Name:PC1 */
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_ADC PORT_FUNC1 

