leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5668_portdefs.h
/* Pin:34 Name:PC2 */
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:35 Name:PC3 */
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:36 Name:PC4 */
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_ADC PORT_FUNC1 

/* Pin:37 Name:PC5 */
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:38 Name:PC6 */
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:39 Name:PC7 */
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_FLEXRAY PORT_FUNC2 

/* Pin:40 Name:PC8 */
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_FLEXRAY PORT_FUNC2 

/* Pin:41 Name:PC9 */
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_FLEXRAY PORT_FUNC2 

/* Pin:42 Name:PC10 */
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_FLEXRAY PORT_FUNC2 

/* Pin:43 Name:PC11 */
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:44 Name:PC12 */
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER3 PORT_FUNC2 

/* Pin:45 Name:PC13 */
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER PORT_FUNC3 

/* Pin:46 Name:PC14 */
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER PORT_FUNC2 

/* Pin:47 Name:PC15 */
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER PORT_FUNC2 

/* Pin:48 Name:PD0 */
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_CAN PORT_FUNC1 

/* Pin:49 Name:PD1 */
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_CAN PORT_FUNC1 

/* Pin:50 Name:PD2 */
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_CAN PORT_FUNC1 

/* Pin:51 Name:PD3 */
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_CAN PORT_FUNC1 

/* Pin:52 Name:PD4 */
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_CAN PORT_FUNC1 

/* Pin:53 Name:PD5 */
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_CAN PORT_FUNC1 

/* Pin:54 Name:PD6 */
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER3 PORT_FUNC3 

/* Pin:55 Name:PD7 */
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER3 PORT_FUNC3 

/* Pin:56 Name:PD8 */
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER3 PORT_FUNC3 

/* Pin:57 Name:PD9 */
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER3 PORT_FUNC3 

/* Pin:58 Name:PD10 */
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER3 PORT_FUNC3 

/* Pin:59 Name:PD11 */
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER3 PORT_FUNC3 

/* Pin:60 Name:PD12 */
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER1 PORT_FUNC1 

/* Pin:61 Name:PD13 */
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER1 PORT_FUNC1 

/* Pin:62 Name:PD14 */
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER1 PORT_FUNC1 

/* Pin:63 Name:PD15 */
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER1 PORT_FUNC1 

/* Pin:64 Name:PE0 */
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:65 Name:PE1 */
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:66 Name:PE2 */
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:67 Name:PE3 */
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:68 Name:PE4 */
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:69 Name:PE5 */
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:70 Name:PE6 */
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:71 Name:PE7 */
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PWM PORT_FUNC2 

/* Pin:72 Name:PE8 */
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_SPI_A PORT_FUNC2 

/* Pin:73 Name:PE9 */
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_SPI_A PORT_FUNC2 

