leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5668_portdefs.h
/* Pin:74 Name:PE10 */
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_SPI_B PORT_FUNC2 

/* Pin:75 Name:PE11 */
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_SPI_B PORT_FUNC2 

/* Pin:76 Name:PE12 */
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_SPI_C PORT_FUNC2 

/* Pin:77 Name:PE13 */
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_SPI_C PORT_FUNC2 

/* Pin:78 Name:PE14 */
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI_D PORT_FUNC2 

/* Pin:79 Name:PE15 */
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI_D PORT_FUNC2 

/* Pin:80 Name:PF0 */
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pin:81 Name:PF1 */
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI_A PORT_FUNC1 

/* Pin:82 Name:PF2 */
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI_A PORT_FUNC1 

/* Pin:83 Name:PF3 */
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI_A PORT_FUNC1 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:84 Name:PF4 */
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI_A PORT_FUNC2 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:85 Name:PF5 */
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI_B PORT_FUNC1 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI_A PORT_FUNC2 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:86 Name:PF6 */
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI_B PORT_FUNC1 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI_A PORT_FUNC2 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:87 Name:PF7 */
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI_B PORT_FUNC1 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI_C PORT_FUNC2 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI_D PORT_FUNC3 

/* Pin:88 Name:PF8 */
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pin:89 Name:PF9 */
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_SPI_C PORT_FUNC1 

/* Pin:90 Name:PF10 */
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_SPI_C PORT_FUNC1 

/* Pin:91 Name:PF11 */
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI_C PORT_FUNC1 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI_D PORT_FUNC2 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI_A PORT_FUNC3 

/* Pin:92 Name:PF12 */
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pin:93 Name:PF13 */
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_SPI_D PORT_FUNC1 

/* Pin:94 Name:PF14 */
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_SPI_D PORT_FUNC1 

/* Pin:95 Name:PF15 */
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_SPI_D PORT_FUNC1 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_SPI_A PORT_FUNC2 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_SPI_B PORT_FUNC3 

/* Pin:96 Name:PG0 */
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_SPI_A PORT_FUNC1 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:97 Name:PG1 */
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_SPI_A PORT_FUNC1 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:98 Name:PG2 */
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI_D PORT_FUNC1 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:99 Name:PG3 */
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI_D PORT_FUNC1 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:100 Name:PG4 */
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_SPI_D PORT_FUNC1 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:101 Name:PG5 */
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_SPI_D PORT_FUNC1 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:102 Name:PG6 */
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_SPI_C PORT_FUNC1 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:103 Name:PG7 */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_SPI_C PORT_FUNC1 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:104 Name:PG8 */
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:105 Name:PG9 */
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:106 Name:PG10 */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ADC PORT_FUNC3 

