leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5668_portdefs.h
/* Pin:107 Name:PG11 */
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:108 Name:PF12 */
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:109 Name:PG13 */
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:110 Name:PG14 */
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:111 Name:PG15 */
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pin:112 Name:PH0 */
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:113 Name:PH1 */
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:114 Name:PH2 */
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:114 Name:PH4 */
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:115 Name:PH3 */
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:117 Name:PH5 */
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:118 Name:PH6 */
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:119 Name:PH7 */
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ETH PORT_FUNC2 

/* Pin:120 Name:PH8 */
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:121 Name:PH9 */
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:122 Name:PH10 */
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:123 Name:PH11 */
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:124 Name:PH12 */
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:125 Name:PH13 */
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:126 Name:PH14 */
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:127 Name:PH15 */
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:128 Name:PJ0 */
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_SPI_A PORT_FUNC2 

/* Pin:129 Name:PJ1 */
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_SPI_A PORT_FUNC2 

/* Pin:130 Name:PJ2 */
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_SPI_B PORT_FUNC2 

/* Pin:131 Name:PJ3 */
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_SPI_B PORT_FUNC2 

/* Pin:132 Name:PJ4 */
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_SPI_C PORT_FUNC2 

/* Pin:133 Name:PJ5 */
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_SPI_C PORT_FUNC2 

/* Pin:134 Name:PJ6 */
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_SPI_D PORT_FUNC2 

/* Pin:135 Name:PJ7 */
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_SPI_D PORT_FUNC2 

/* Pin:136 Name:PJ8 */
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:137 Name:PJ9 */
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_PWM PORT_FUNC1 

