leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5668_portdefs.h
/* Pin:138 Name:PJ10 */
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:139 Name:PJ11 */
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:140 Name:PJ12 */
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:141 Name:PJ13 */
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:142 Name:PJ14 */
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:143 Name:PJ15 */
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_PWM PORT_FUNC1 

/* Pin:144 Name:PK0 */
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER3 PORT_FUNC3 

/* Pin:145 Name:PK1 */
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI_D PORT_FUNC3 

/* Pin:146 Name:PK2 */
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_SPI_D PORT_FUNC3 

/* Pin:147 Name:PK3 */
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER PORT_FUNC2 
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:148 Name:PK4 */
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER PORT_FUNC2 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:149 Name:PK5 */
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER PORT_FUNC2 
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:150 Name:PK6 */
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:151 Name:PK7 */
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_SPI_C PORT_FUNC3 

/* Pin:152 Name:PK8 */
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_SPI_B PORT_FUNC2 
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_SPI_A PORT_FUNC3 

/* Pin:153 Name:PK9 */
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_SPI_D PORT_FUNC2 
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_SPI_A PORT_FUNC3 
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER_A PORT_FUNC4 

/* Pin:154 Name:PK10 */
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_SPI_B PORT_FUNC1 
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_SPI_D PORT_FUNC2 
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_SPI_A PORT_FUNC3 

#endif  /* _MPC5668PORTS_H*/ 
